Revit 2020 API
DocumentEntryPoint.Export Method
Overload List
Name | Description
Export(String, String, MassGBXMLExportOptions)
 Exports a gbXML file from a mass model document.
 (Inherited from Document.)
Export(String, String, GBXMLExportOptions)
 Export the model in gbXML (green-building) format.
 (Inherited from Document.)
Export(String, String, IFCExportOptions)
 Exports the document to the Industry Standard Classes (IFC) format.
 (Inherited from Document.)
Export(String, String, NavisworksExportOptions)
 Exports a Revit project to the Navisworks .nwc format.
 (Inherited from Document.)
Export(String, String, ViewSet, DWFExportOptions)
Exports the current view or a selection of views in DWF format.
 (Inherited from Document.)
Export(String, String, ViewSet, DWFXExportOptions)
Exports the current view or a selection of views in DWFX format.
 (Inherited from Document.)
Export(String, String, ViewSet, FBXExportOptions)
Exports the document in 3D-Studio Max (FBX) format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, DGNExportOptions)
 Exports a selection of views in DGN format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, DWGExportOptions)
 Exports a selection of views in DWG format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, DXFExportOptions)
 Exports a selection of views in DXF format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, SATExportOptions)
 Exports the current view or a selection of views in SAT format.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace